from aiogram.types import FSInputFile

WELCOME_TEXT = """
Привет! Это Svinder.
Здесь можно найти любовь, друзей… ну или хотя бы человека, который будет делиться с тобой мемами ночью)

_Нажми *"Начать"*, чтобы создать свою анкету или посмотреть другие!_ 

Поддержка: @SvinderSupportBot
"""


WELCOME_IMAGE = FSInputFile("src/static/bot/image.png")

COMPLAINS : dict[str, str] = {
    'sex': 'Пол',
    'photo': 'Фото',
    'imposter': 'Выдача себя за другого человека',
    'other': 'Другое',
}

text_main_menu = """
┏━━━━━━ * SVINDER * ━━━━━━┓
  Вы можете:
 - Cмотреть анкеты
 - Посмотреть кто вас лайкнул
 - Отредактировать анкету

┗━ *Выбирай кнопку ниже* ━┛
"""


text_main_menu_get_back = [
    "Рад снова тебя видеть! 😈",
    "Зачем ты удалил наш чат!? Ну ладно, заходи, я соскучился 🥹",
    "Какие люди в Голливуде! Проходи!",
    "Залетай ✈️",
]

text_search_profiles_start = "Нажми кнопку для запуска поиска анкет 👇\n(чтобы вернутся в главное меню просто введи любое сообщение)"

text_search_profiles = "Смотреть анкеты 🔎"
text_edit_profile = "Редактировать свою анкету 🪞"
text_my_likes = "Мои лайки ❤️"
text_my_profile = "Мой профиль"
text_delete_profile = "Удалить профиль 🗑️"

text_yes = "Погнали ✅"
text_no = "Нет ❌"

text_male = "Парень 🗿"
text_female = "Девушка 💃"

text_profile_create_begin = """
Во время создания анкеты тебе будут задаваться вопросы.
Вводи на них ответы и бот 🤖 запомнит твои данные...

ВНИМАНИЕ все неприемлимые анкеты будут удалятся, а пользователи баниться.
"""
